InformationRegisters/ПрайсЛистыКонтрагентовАвтообновление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовАвтообновление</Name>
			<Comment>Настройки автоматической загрузки прайс-листов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьАвтообновление</Name>
					<Comment>Загружать данные из новых файлов автоматически</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьАвтозагрузку</Name>
					<Comment>Проверять и получать новые файлы прайс-листов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешФайла</Name>
					<Comment>Хеш последнего скаченного файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФайла</Name>
					<Comment>Дата изменения файла прайс-листа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Comment>Размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешЗагруженного</Name>
					<Comment>Хеш загруженного</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагруженного</Name>
					<Comment>Дата загруженного</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПроверкиНовыхДанных</Name>
					<Comment>Периодичность проверки наличия новых прайс-листов при авто обновлении</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПроверкиНачало</Name>
					<Comment>Время начала проверок обновлений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПроверкиКонец</Name>
					<Comment>Время окончания проверок обновлений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПроверки</Name>
					<Comment>Дата, с которой надо начать следующую проверку наличия прайс-листа при автообновлении согласно установленной периодичности</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрайсЛистыКонтрагентовЖурналЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовЖурналЗагрузки</Name>
			<Comment>Журнал загрузки прайс-листов контрагентов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус загрузки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗагрузкиПрайсЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Comment>Строка подключения к прайс-листу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПодключенияАрхив</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФайла</Name>
					<Comment>Дата файла или письма</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешФайла</Name>
					<Comment>Хеш файла или идентификатор письма</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Примечание к статусу загрузки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогЗагрузки</Name>
					<Comment>Лог загрузки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОЗагрузке</Name>
					<Comment>Информация о загрузке</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Comment>Идентификатор фонового задания</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор изменения состояния</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗагрузкиПрайсЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыЗагрузкиПрайсЛистов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разрешена</Name>
					<Comment>Загрузка разрешена</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрещена</Name>
					<Comment>Загрузка запрещена</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
					<Comment>Ожидает загрузки в базу данных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружается</Name>
					<Comment>Выполняется процесс загрузки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прервана</Name>
					<Comment>Загрузка прервана</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Загрузка завершена с ошибкой</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
					<Comment>Загрузка успешно завершена</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйФайл</Name>
					<Comment>Получен новый файл для загрузки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйФайлОшибка</Name>
					<Comment>Ошибка при проверке и получении нового файла</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПрайсЛистыКонтрагентовАвтообновление/Ext/ManagerModule.bsl
// Модуль менеджера регистра "Прайс-листы контрагентов автообновление"
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Записать настройки автообновления
//
// Параметры:
//  ПрайсЛист	 - СправочникСсылка.ПрайсЛистыКонтрагентов	 - Прайс лист
//  Настройки	 - Массив									 - Значение настроек.
// 
// Возвращаемое значение:
//  Булево - Булево.
//
Функция ЗаписатьНастройкиАвтообновления(ПрайсЛист, Настройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовАвтообновление.СоздатьМенеджерЗаписи();
	Менеджер.ПрайсЛист = ПрайсЛист;
	Менеджер.Прочитать();
	
	Если НЕ Менеджер.Выбран() Тогда
		Менеджер.ПрайсЛист = ПрайсЛист;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Менеджер, Настройки);
	
	Попытка
		Менеджер.Записать(Истина);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Запись не удалась: %1.'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()))
		);
	КонецПопытки;
	
КонецФункции

// Функция - Прочитать настройки автообновления
//
// Параметры:
//  ПрайсЛист	 - СправочникСсылка.ПрайсЛистыКонтрагентов	 - Прайс лист.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - результат работы запроса.
//
Функция ПрочитатьНастройкиАвтообновления(ПрайсЛист) Экспорт
	Результат = Новый Структура("ХешФайла,ДатаФайла,Транспорт,РазмерФайла,ХешЗагруженного,ДатаЗагруженного,ПериодичностьПроверкиНовыхДанных,ИнтервалПроверкиНачало,ИнтервалПроверкиКонец,ДатаСледующейПроверки");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентовАвтообновление.ХешФайла,
	|	ПрайсЛистыКонтрагентовАвтообновление.ДатаФайла,
	|	ПрайсЛистыКонтрагентовАвтообновление.ПрайсЛист.Транспорт КАК Транспорт,
	|	ПрайсЛистыКонтрагентовАвтообновление.РазмерФайла,
	|	ПрайсЛистыКонтрагентовАвтообновление.ХешЗагруженного,
	|	ПрайсЛистыКонтрагентовАвтообновление.ДатаЗагруженного,
	|	ПрайсЛистыКонтрагентовАвтообновление.ПериодичностьПроверкиНовыхДанных,
	|	ПрайсЛистыКонтрагентовАвтообновление.ИнтервалПроверкиНачало,
	|	ПрайсЛистыКонтрагентовАвтообновление.ИнтервалПроверкиКонец,
	|	ПрайсЛистыКонтрагентовАвтообновление.ДатаСледующейПроверки
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовАвтообновление КАК ПрайсЛистыКонтрагентовАвтообновление
	|ГДЕ
	|	ПрайсЛистыКонтрагентовАвтообновление.ПрайсЛист = &ПрайсЛист";
	Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Процедура - Сдвинуть дату проверки файлов
//
// Параметры:
//  ПрайсЛист	 - СправочникСсылка.ПрайсЛистыКонтрагентов	 - Прайс лист
//  Часов		 - Число									 - Количество часов.
//
Процедура СдвинутьДатуПроверкиФайлов(ПрайсЛист, Часов) Экспорт
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовАвтообновление");
	ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛист);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовАвтообновление.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛист);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Блокировка.Заблокировать();
		
		НоваяДата = ТекущаяДатаСеанса() + Часов * 3600;
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.ДатаСледующейПроверки = НоваяДата;
		КонецЦикла;
		НачатьТранзакцию();
		Попытка
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
		
		
	КонецЕсли;
КонецПроцедуры

// Функция - Есть прайс листы с автозагрузкой
//
// Параметры:
//  ПрайсЛистыСАвтозагрузкой - ТаблицаЗначений	 - Прайс-листы с автозагрузкой.
// 
// Возвращаемое значение:
//  Булево - Признак наличия прайс-листа с автозагрузкой.
//
Функция ЕстьПрайсЛистыСАвтозагрузкой(ПрайсЛистыСАвтозагрузкой) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентовАвтообновление.ПрайсЛист,
	|	ПрайсЛистыКонтрагентовАвтообновление.ХешФайла,
	|	ПрайсЛистыКонтрагентовАвтообновление.ДатаФайла,
	|	ПрайсЛистыКонтрагентовАвтообновление.ПрайсЛист.Транспорт КАК Транспорт,
	|	ПрайсЛистыКонтрагентовАвтообновление.РазмерФайла
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовАвтообновление КАК ПрайсЛистыКонтрагентовАвтообновление
	|ГДЕ
	|	ПрайсЛистыКонтрагентовАвтообновление.ИспользоватьАвтозагрузку = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПрайсЛистыСАвтозагрузкой = Неопределено;
		Возврат Ложь;
	Иначе
		ПрайсЛистыСАвтозагрузкой = Результат.Выгрузить();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формитует список прайс-листов с необходимостью обновления.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ПрайсЛистыКонтрагентов
//
Функция ДайПрайсЛистыДляОбновления() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Автообновление.ПрайсЛист КАК ПрайсЛист
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовАвтообновление КАК Автообновление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрайсЛистыКонтрагентовЖурналЗагрузки.СрезПоследних(, ) КАК ЖурналЗагрузки
	|		ПО (ЖурналЗагрузки.ПрайсЛист = Автообновление.ПрайсЛист)
	|ГДЕ
	|	Автообновление.ИспользоватьАвтообновление
	|	И Автообновление.ДатаСледующейПроверки <= &ТекущаяДата
	|	И (Автообновление.ПериодичностьПроверкиНовыхДанных <> 1
	|			ИЛИ Автообновление.ИнтервалПроверкиНачало <= &ТекущаяДатаЧас
	|				И Автообновление.ИнтервалПроверкиКонец > &ТекущаяДатаЧас)
	|	И (ЖурналЗагрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗагрузкиПрайсЛистов.Разрешена)
	|			ИЛИ ЖурналЗагрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗагрузкиПрайсЛистов.НовыйФайл)
	|			ИЛИ ЖурналЗагрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗагрузкиПрайсЛистов.НовыйФайлОшибка)
	|			ИЛИ ЖурналЗагрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗагрузкиПрайсЛистов.Ожидает)
	|			ИЛИ ЖурналЗагрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗагрузкиПрайсЛистов.Прервана)
	|			ИЛИ ЖурналЗагрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗагрузкиПрайсЛистов.Завершена)
	|			ИЛИ ЖурналЗагрузки.Статус ЕСТЬ NULL)";
	
	ДатаПроверки = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("ТекущаяДата"    , ДатаПроверки);
	Запрос.УстановитьПараметр("ТекущаяДатаЧас" , Час(ДатаПроверки));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПрайсЛист");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Перезаполняет реквизит ПериодичностьПроверкиНовыхДанных - изменился формат хранения.
//
Процедура ПерезаполнитьПериодичностьПроверки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентовАвтообновление.ПрайсЛист КАК ПрайсЛист
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовАвтообновление КАК ПрайсЛистыКонтрагентовАвтообновление
	|ГДЕ
	|	ПрайсЛистыКонтрагентовАвтообновление.ИспользоватьАвтообновление
	|	И ПрайсЛистыКонтрагентовАвтообновление.ПериодичностьПроверкиНовыхДанных > 1";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПрайсЛистыКонтрагентовАвтообновление.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПрайсЛист = Выборка.ПрайсЛист;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			Если МенеджерЗаписи.ПериодичностьПроверкиНовыхДанных > 2 И МенеджерЗаписи.ПериодичностьПроверкиНовыхДанных < 9 Тогда
				// раз в неделю
				МенеджерЗаписи.ПериодичностьПроверкиНовыхДанных = 7;
			Иначе
				// раз в месяц
				МенеджерЗаписи.ПериодичностьПроверкиНовыхДанных = 30;
			КонецЕсли;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли
